{
  "about_us": "Quotesouk is India's emerging business-to-business E-Commerce platform.  Quotesouk is the first of its type in India. It was founded by ABHET in 2022 with the mission to &rdquo;change the way trade is done between sellers and buyers by leveraging technology.&rdquo;  Buyers can post their requirements precisely on Quotesouk.com. According to the buyer's specifications, suppliers can offer quotations for the goods or services while yet retaining a manageable profit margin.Power tools, Medical Supplies, Softwares, Workshop Equipment, Motors & Power Transmission, Pneumatics,Safety Devices, Fasteners, Construction, Hand Tools, Welding Equipment, Appliances, Plumbing and Furniture are just a few of the categories in which it operates. Our app will assist in facilitating the purchasing and selling process as an online business facilitator, resulting in the buyer receiving the product at a competitive price. In this manner, our tagline, &rdquo;Let sellers come to you,&rdquo; has been framed.By utilizing technology and bringing the advantages of E-Commerce tools, Quotesouk is resolving fundamental trade issues that are exclusive to small and medium-sized businesses. The platform serves as a facilitator to enable accessibility, affordability and national reach for the emerging MSMEs in India.Small businesses and brands may market and sell their goods in the market at a reasonable cost with 100% payment security and total transparency thanks to Quotesouk App. In the process, it makes it possible for small businesses to source from a wide range of high-quality products at the best costs while facilitating quick and easy transactions.It allows the buyer to choose a product, make an order with the seller, who then packs and ships the product through Quotesouk App.  It offers better price control and cost-effective access to new markets and geographical areas.The platform has made it possible to build logistics for B2B trade that is based on reliable and latest technology and operations for fulfilment and delivery of  services through QS Logistics.Sellers can make well-informed decisions on product releases and the testing of new products in various locations thanks to Quotesouk's SaaS offerings, such as analysis of real-time marketing feedback through data analytics tools. Quotesouk will be opening it's offices in all of India's largest metropolises and major cities, and Quotesouk has its headquarters in Ernakulam.",
  "about1": "Quotesouk is India's emerging business-to-business E-Commerce platform.  Quotesouk is the first of its type in India. It was founded by ABHET in 2022 with the mission to &rdquo;change the way trade is done between sellers and buyers by leveraging technology.&rdquo; Buyers can post their requirements precisely on Quotesouk.com. According to the buyer's specifications, suppliers can offer quotations for the goods or services while yet retaining a manageable profit margin.",
  "about2": "Power tools, Medical Supplies, Softwares, Workshop Equipment, Motors & Power Transmission, Pneumatics,Safety Devices, Fasteners, Construction, Hand Tools, Welding Equipment, Appliances, Plumbing and Furniture are just a few of the categories in which it operates. Our app will assist in facilitating the purchasing and selling process as an online business facilitator, resulting in the buyer receiving the product at a competitive price. In this manner, our tagline, &rdquo;Let sellers come to you,&rdquo; has been framed.",
  "about3": "By utilizing technology and bringing the advantages of E-Commerce tools, Quotesouk is resolving fundamental trade issues that are exclusive to small and medium-sized businesses. The platform serves as a facilitator to enable accessibility, affordability and national reach for the emerging MSMEs in India. ",
  "about4": "Small businesses and brands may market and sell their goods in the market at a reasonable cost with 100% payment security and total transparency thanks to Quotesouk App. In the process, it makes it possible for small businesses to source from a wide range of high-quality products at the best costs while facilitating quick and easy transactions.",
  "about5": "It allows the buyer to choose a product, make an order with the seller, who then packs and ships the product through Quotesouk App.  It offers better price control and cost-effective access to new markets and geographical areas.",
  "about6": "The platform has made it possible to build logistics for B2B trade that is based on reliable and latest technology and operations for fulfilment and delivery of  services through QS Logistics. ",
  "about7": "Sellers can make well-informed decisions on product releases and the testing of new products in various locations thanks to Quotesouk's SaaS offerings, such as analysis of real-time marketing feedback through data analytics tools. Quotesouk will be opening it's offices in all of India's largest metropolises and major cities, and Quotesouk has its headquarters in Ernakulam.",

  "vision": "TO GROW AS A HOLISTIC B2B AND B2C E-COMMERCE FACILITATOR BREAKING THE BARRIERS OF BUDGET, LOUNGING, LANGUAGE AND LOCATION.",
  "mission": "TO MAKE AVAILABLE QUALITY PRODUCTS AND SERVICES TO THE RETAIL LEVEL THROUGH MULTIPLE QUOTES AND PRICE COMPARISON FOR THE BENEFIT OF BUYERS ALONG WITH COST REDUCTION TO THE SELLERS.",
  "mission1": "On its way to conquer D5TS-Quotesouk.<br><br><br>Its mission, codenamed D5TS — Discover five treasures of Snows. The third-highest peak in the world is Kanchenjunga. &rdquo;The Five Treasures of Snows&rdquo; is the meaning of the name Kanchenjunga. Since Kanchenjunga is the third-tallest mountain in the world and is regarded as the most challenging one to climb upon, it represents Quotesouk's shared goal of dominating the e-commerce industry. To hit its goals, Quotesouk has a well-thought-out strategy and aggressive growth ambitions.<br><br> Quotesouk needs to log a CAGR of 15% in order to reach the aspirational level. It won't appear through organic growth. Quotesouk also needs to grow in an artificial way to accomplish this. For this, Quotesouk has the necessary technology, personnel, method, and product.",
  "mission2": "The parent firm, Aptdealz, is supporting this strategy by selecting target demographics, primarily Pan India suppliers and customers, and then gradually growing to Global level. It uses a funnel strategy. Quotesouk has a short-term goal of earning 1.5 crores in revenue and hopes to follow a hockey stick growth pattern.",
  "mission3": "Quotesouk has high hopes for technology, and it will use innovation to surpass competitors in the e-commerce industry. Quotesouk has consistently concentrated on enhancing its focus on homegrown technology and creating fresher, better solutions for the market.",
  "mission4": "The following chapter in Quotesouk's history looks to be more than promising with defined short- and long-term objectives. The business's daring approach serves as evidence of its new brand motto, &rdquo;Let Sellers come to you.&rdquo;",
  "cors": "PEOPLE FOCUSSED:&nbsp; Cohesiveness and togetherness will result in more synergy and better effectiveness for the betterment of participants.<br><br>INNOVATION :&nbsp; A culture of innovation will brighten the company and help us remain a step ahead of others.<br><br> CUSTOMER ORIENTED &nbsp; Our activities are designed to provide the finest customer experience and satisfaction with the help of technology. We try to collaborate in the lives and businesses of our customers.<br><br> INTEGRITY &nbsp; Integrity has always been the cornerstone of our company. Because of our dedication, integrity, reliability and openness, we are admired and regarded at all times. We act morally and responsibly even in situations where there are no watch or guard<br><br> QUALITY:&nbsp; Building confidence with stakeholders and customers requires consistent delivery of quality and we believe in it.<br><br> SPEED:&nbsp; We react to opportunities and threats very rapidly.<br><br> We take pleasure in creating long-lasting connections with our customers and we thrive to give a significant influence on their businesses, whether it be through partnerships or otherwise through our services. Today, QUOTESOUK is renowned for the fidelity of its services, cutting-edge technology and values that come from our fundamental conviction that making long-term investments and commitments are well sustainable.<br><br> We are an ISO Certified organisation apart from other renowned certifications and we have established best-in-class practices that adhere to global standards. We firmly believe in implementing sound business procedures and practices and we work continuously to deliver the best results to the stakeholders. Since we trust in the paramount satisfaction of our clients and partners, we are always among the top selection.",
  "testimonials":[
    {
      "name":"Rashmi Babu Ts",
      "designation":"Managing director",
      "message":"Quotesouk is a trusted business partner for sellers like me. Their market knowledge, combined with their excellent customer service, has made my experience genuinely extraordinary. I'm overjoyed with my accomplishments and look forward to continuing my success with Quotesouk."
    },
    {
      "name":"Rashmi Babu Ts",
      "designation":"Managing director",
      "message":"Quotesouk is a trusted business partner for sellers like me. Their market knowledge, combined with their excellent customer service, has made my experience genuinely extraordinary. I'm overjoyed with my accomplishments and look forward to continuing my success with Quotesouk."
    },
    {
      "name":"Rashmi Babu Ts",
      "designation":"Managing director",
      "message":"Quotesouk is a trusted business partner for sellers like me. Their market knowledge, combined with their excellent customer service, has made my experience genuinely extraordinary. I'm overjoyed with my accomplishments and look forward to continuing my success with Quotesouk."
    },
    {
      "name":"Rashmi Babu Ts",
      "designation":"Managing director",
      "message":"Quotesouk is a trusted business partner for sellers like me. Their market knowledge, combined with their excellent customer service, has made my experience genuinely extraordinary. I'm overjoyed with my accomplishments and look forward to continuing my success with Quotesouk."
    }
  ]
}
